cases/fluids/lid_driven_cavity_re1000/solution/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

transportModel  Newtonian;
nu              0.001;   // U_lid=1, L=1 -> Re = 1/nu = 100
