cases/fluids/lid_driven_cavity_re1000/solution/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (0 0 0)     // 0
    (1 0 0)     // 1
    (1 1 0)     // 2
    (0 1 0)     // 3
    (0 0 1)     // 4
    (1 0 1)     // 5
    (1 1 1)     // 6
    (0 1 1)     // 7
);

blocks
(
    // 80 x 80 cells, uniform — sufficient for Re=1000 laminar (needs finer resolution) cavity.
    hex (0 1 2 3 4 5 6 7) (120 120 1) simpleGrading (1 1 1)
);

edges ();

boundary
(
    movingWall
    {
        type wall;
        faces ((3 7 6 2));
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
